%% 需要初始值，无需参考节点，s与rdoa对应上即可，可参考testbench
function u = TDOA_NEWTON_2D(u0,s,rdoa_s)
M = size(s,2)/2;
for i = 1:500
for j = 1:M
    F0(j,1) = 2*u0(1)*(s(1,2*j-1) - s(1,2*j)) + 2*u0(2)*(s(2,2*j-1) - s(2,2*j)) + ...
             2*rdoa_s(j)*((u0(1) - s(1,2*j))^2 + (u0(2) - s(2,2*j))^2)^0.5 -...
             (s(1,2*j-1)^2 + s(2,2*j-1)^2) + (s(1,2*j)^2 + s(2,2*j)^2) + rdoa_s(j)^2;
end
%% 构造矩阵
for k = 1:M
    dF(k,1) = 2*(s(1,2*k-1) - s(1,2*k)) + 2*rdoa_s(k)*(u0(1) - s(1,2*k))/(((u0(1) - s(1,2*k))^2 + (u0(2) - s(2,2*k))^2)^0.5);
    dF(k,2) = 2*(s(2,2*k-1) - s(2,2*k)) + 2*rdoa_s(k)*(u0(2) - s(2,2*k))/(((u0(1) - s(1,2*k))^2 + (u0(2) - s(2,2*k))^2)^0.5);
end
u0 = u0 - inv(dF'*dF)*dF'*F0;
end
u = u0; 